Repository: nker31/Pokedex-Nextzy-UIKit
Catalog: Pokedex-Nextzy-UIKit/Pokedex-Nextzy-UIKit/*.lproj/Localizable.strings
Languages: th

# email_label_text
source: Email
th: อีเมล

# password_label_text
source: Password
th: รหัสผ่าน

# login_button_text
source: Login
th: เข้าสู่ระบบ

# register_button_text
source: No account ? Register
th: ไม่มีบัญชีเหรอ ลงทะเบียนสิ

# forgot_password_button_text
source: Forgot password ?
th: ลืมรหัสผ่าน ?

# register_title
source: Register
th: ลงทะเบียน

# confirm_password_label_text
source: Confirm Password
th: ยืนยันรหัสผ่าน

# first_name_label_text
source: First name
th: ชื่อจริง

# last_name_label_text
source: Last name
th: นามสกุล

# forgot_password_title
source: Forgot Password
th: ลืมรหัสผ่าน

# pokedex_tabbar_title
source: Pokedex
th: โปเกเด็กซ์

# my_pokemon_tabbar_title
source: My Pokemon
th: โปเกม่อนที่ชอบ

# profile_tabbar_title
source: Profile
th: โปรไฟล์

# about_segment_title
source: About
th: ข้อมูลทั่วไป

# stat_segment_title
source: Stats
th: ค่าพลัง

# evolution_segment_title
source: Evolutions
th: การวิวัฒนาการ

# cancel_button_text
source: Cancel
th: ยกเลิก

# pokemon_name_placeholder
source: Enter pokemon name
th: กรอกชื่อโปเกม่อน

# no_result_label_text
source: No result for
th: ไม่พบโปเกม่อนที่ค้นหา

# empty_pokemon_label_text
source: You haven't added any Pok√©mon to your favorite list yet.
th: คุณยังไม่มีโปเกม่อนที่ชื่นชอบ

# edit_profile_title
source: Edit My Profile
th: แก้ไขข้อมูลส่วนตัว

# terms_and_conditions_title
source: Terms and Conditions
th: ข้อตกลงและเงื่อนไขการใช้บริการ

# sign_out_button_text
source: Sign Out
th: ออกจากระบบ

# update_button_text
source: Update
th: อัปเดต

# email_placeholder
source: Enter your email
th: กรอกอีเมลของคุณ

# password_placeholder
source: Enter your password
th: กรอกรหัสผ่านของคุณ

# confirm_password_placeholder
source: Enter your confirm password
th: ยืนยันรหัสผ่าน

# first_name_placeholder
source: Enter your first name
th: กรอกชื่อจริงของคุณ

# last_name_placeholder
source: Enter your last name
th: กรอกนามสกุลของคุณ

# loading_label_text
source: Loading
th: กำลังโหลด

# alert_invalid_email
source: Invalid email
th: อีเมลไม่ถูกต้อง

# alert_invalid_password
source: Password must be at least 8 character
th: รหัสผ่านต้องมีความยาว 8 ตัวอักษรขึ้นไป

# alert_invalid_confirm_password
source: Password does not match with Confirm password
th: รหัสผ่านและยืนยันรหัสผ่านไม่สัมพันธ์กัน

# alert_invalid_name
source: Firstname and Lastname must be at least 3 characters
th: ชื่อจริงและนามสกุลต้องมีความยาวอย่างน้อย 3 ตัวอักษรขึ้นไป

# alert_login_failed
source: Wrong email or password
th: อีเมลหรือรหัสผ่านไม่ถูกต้อง

# alert_register_failed
source: Register failed
th: ลงทะเบียนล้มเหลว

# alert_update_success
source: Update data successfully
th: แก้ไขข้อมูลเสร็จสิ้น

# alert_update_failed
source: Update data failed
th: เกิดข้อผิดพลาดในการแก้ไขข้อมูล

# alert_reset_success
source: Reset password email has been sent
th: อีเมลสำหรับรีเซ็ตรหัสผ่านได้ถูกส่งไปยังอีเมลของคุณแล้ว

# alert_reset_failed
source: Failed to reset password Please try again
th: รีเซ็ตรหัสผ่านล้มเหลว โปรดลองใหม่อีกครั้ง
